export {}
// ⁡⁢⁣⁣Redux⁡ — это ⁡⁣⁣⁢JavaScript-библиотека⁡, призванная ⁡⁢⁣⁣упростить управление состоянием⁡ вашего веб-приложения. 
// Её основное назначение заключается в том, чтобы сделать управление данными более ⁡⁣⁣⁢организованным⁡ и ⁡⁣⁣⁢предсказуемым⁡.

// В центре концепции Redux находится ⁡⁣⁣⁢хранилище состояния⁡ (⁡⁢⁣⁣Store⁡). Это своеобразное хранилище, ⁡⁣⁣⁢где собраны⁡ все данные вашего приложения. 
// Однако важное отличие от традиционного подхода заключается в том, что Redux предлагает ⁡⁢⁣⁣единое централизованное хранилище⁡,
// доступное для всех компонентов вашего приложения. Это как общий банк данных, к которому можно обратиться из любой точки приложения.

// Итак, данный инструмент позволяет нам эффективно управлять данными, делая процесс разработки более организованным и предсказуемым

// Принцип того, как работает redux, основывается на таких концепциях:

// ⁡⁢⁣⁣Application state⁡: это объект, который содержит все данные, необходимые для работы приложения.
// ⁡⁢⁣⁣Actions⁡: это объекты, которые представляют изменения состояния приложения.
// ⁡⁢⁣⁣Reducers⁡: это функции, которые определяют, как состояние приложения изменяется в ответ на действия.