export {};
// ⁡⁢⁣⁣Хуки (hooks)⁡ - это новое дополнение в React ⁡⁣⁢⁣16.8⁡, которое позволяет вам использовать ⁡⁣⁣⁢состояние (state)⁡, 
// ⁡⁣⁣⁢контекст (context)⁡, ⁡⁣⁣⁢эффекты (effects)⁡ и другие функциональности React в функциональных компонентах. 
// Ранее эти функциональности были доступны только в классовых компонентах.

// Хуки предоставляют простой и декларативный ⁡⁣⁣⁢способ организации⁡ и ⁡⁣⁣⁢повторного использования⁡ логики компонентов. 
// Они позволяют ⁡⁢⁣⁢избежать⁡ ⁡⁣⁣⁢использования ⁡⁢⁣⁣классов⁡⁡ и вместо этого писать компоненты в виде ⁡⁢⁣⁣чистых функций⁡.