// ⁡⁢⁣⁣URI⁡ (⁡⁣⁣⁢Uniform Resource Identifier⁡) - это строка, которая идентифицирует какой-либо ресурс в сети.
// ⁡⁢⁣⁣URI⁡ является общим термином, который ⁡⁣⁣⁢охватывает⁡ как ⁡⁢⁣⁣URL⁡ (Uniform Resource Locator), так и ⁡⁢⁣⁣URN⁡ (Uniform Resource Name).

// Вот более подробное объяснение:

// ⁡⁢⁣⁣URL⁡ (⁡⁣⁣⁢Uniform Resource Locator⁡): ⁡⁢⁣⁣URL⁡ - это ⁡⁣⁣⁢подтип⁡ ⁡⁢⁣⁣URI⁡ и, возможно, самый распространенный. 
// URL используется для указания местоположения ресурса в сети. URL включает в себя схему (например, "http" или "https"), 
// доменное имя, порт (если нужно), путь к ресурсу и другие компоненты. Примеры URL включают веб-адреса,
// такие как "https://www.example.com" или "ftp://ftp.example.com/file.txt".

// ⁡⁢⁣⁣URN ⁡(⁡⁣⁣⁢Uniform Resource Name⁡): ⁡⁢⁣⁣URN⁡ также является ⁡⁣⁣⁢подтипом⁡ ⁡⁢⁣⁣URI⁡. В отличие от URL, 
// который указывает на местоположение ресурса, URN представляет собой уникальное имя ресурса, которое не зависит от его местоположения. 
// URN может использоваться для идентификации ресурса независимо от того, где он находится в сети. 
// Пример URN: "urn:isbn:0451450523", где "urn:isbn:" идентифицирует ресурс как книгу по ISBN.

// ⁡⁢⁣⁣URI⁡ ⁡⁣⁣⁢представляет собой⁡ ⁡⁢⁣⁣структурированную строку⁡, которая может быть использована для ⁡⁣⁣⁢нахождения⁡,
// ⁡⁣⁣⁢идентификации⁡ или ⁡⁣⁣⁢взаимодействия с ресурсами в сети⁡. Важно отметить, что URL и URN являются конкретными типами URI, 
// и все URL и URN также являются URI.




