// ⁡⁢⁣⁣TypeScript⁡ - это ⁡⁣⁣⁢строго типизированный⁡ и компилируемый язык программирования. ⁡⁢⁣⁣JavaScript⁡ - ⁡⁣⁣⁢динамически типизированный⁡. 
// ⁡⁢⁣⁣Строгая типизация⁡ - это один из вариантов политики работы с типами данных, под собой подразумевает выполнение следующих условий:

// Объект данных всегда ⁡⁣⁣⁢имеет строго определенный тип⁡
// Переменной может присвоится только ⁡⁣⁣⁢строго тот же тип данных⁡, что и переменная
// Операции требуют параметры строго определенных типов
// ⁡⁣⁣⁢Неявное преобразование типов ⁡⁢⁣⁢не допускается⁡⁡

console.log('Hello TypeScript')