// ⁡⁢⁣⁣200⁡ ⁡⁢⁢⁢OK⁡ - запрос выполнен успешно и сервер возвращает запрошенные данные.
// ⁡⁢⁣⁣301⁡ ⁡⁢⁣⁢Moved Permanently⁡ - запрошенный ресурс перемещен на другой URL, который будет указан в ответе.
// ⁡⁢⁣⁣400⁡ ⁡⁢⁣⁢Bad Request⁡ - сервер не может обработать запрос из-за неверного синтаксиса или параметров запроса.
// ⁡⁢⁣⁣401⁡ ⁡⁢⁣⁢Unauthorized⁡ - запрос требует аутентификации, но пользователь не был авторизован для доступа к запрошенному ресурсу.
// ⁡⁢⁣⁣403⁡ ⁡⁢⁣⁢Forbidden⁡ - сервер отказывает в доступе к запрашиваемому ресурсу, потому что у пользователя нет соответствующих разрешений.
// ⁡⁢⁣⁣404⁡ ⁡⁢⁣⁢Not Found⁡ - сервер не может найти запрошенный ресурс.
// ⁡⁢⁣⁣500⁡ ⁡⁢⁣⁢Internal Server Error⁡ - сервер столкнулся с ошибкой на своей стороне и не может выполнить запрос.
// ⁡⁢⁣⁣502⁡ ⁡⁢⁣⁢Bad Gateway⁡ - возникает, когда сервер-шлюз получает недействительный ответ от сервера при попытке выполнить запрос.
// ⁡⁢⁣⁣503⁡ ⁡⁢⁣⁢Service Unavailable⁡ - сервер не может обрабатывать запросы в данный момент из-за технических проблем.